e = {1 : 'один', 2 : 'два', 3 : 'три', 4 : 'четыре', 5 : 'пять',
    6 : 'шесть', 7 : 'семь', 8 : 'восемь', 9 : 'девять'}
d = {10 : 'десять', 20 : 'двадцать', 30 : 'тридцать', 40 : 'сорок',
    50 : 'пятьдесят', 60 : 'шестьдесят', 70 : 'семьдесят',
    80 : 'восемьдесят', 90 : 'девяносто'}
c = {11 : 'одиннадцать', 12 : 'двенадцать', 13 : 'тринадцать',
    14 : 'четырнадцать', 15 : 'пятнадцать', 16 : 'шестнадцать',
    17 : 'семнадцать', 18 : 'восемнадцать', 19 : 'девятнадцать'}
s = {100 : 'сто', 200 : 'двести', 300 : 'триста',
    400 : 'четыреста', 500 : 'пятьсот', 600 : 'шестьсот',
    700 : 'семьсот', 800 : 'восемьсот', 900 : 'девятьсот'}
t = {1000 : 'тысяча'}
n=int(input())
g = n
list = []
while g >0:
    a = g % 10
    g//=10
    list.append(a)
list.reverse()
if n<1 or n>1000:
    print('Error: Incorrect number')
elif n < 10:
    print(e.get(n))
elif 10 < n < 20:
    print(c.get(n))
elif n >= 10 and n in d:
    print(d.get(n))
elif n >= 100 and n in s:
    print(s.get(n))
elif n == 1000:
    print(t.get(n))
elif n > 10 and n < 100:
    print(d.get(list[0]*10) + ' ' + e.get(list[1]))
elif n > 110 and n < 920 and list[1]==1:
    print(s.get(list[0]*100) + ' ' + c.get(n%100))
else:
    print(s.get(list[0]*100) + ' ' + d.get(list[1]*10) + ' ' + e.get(list[2]))
